; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v1 ?v6)
             (pred_9 ?v2 ?v5)
             (pred_1 ?v1 ?v5)
             (pred_2 ?v8 ?v1 )
	     (pred_4 ?v1)
             (pred_7 ?v9)
             (pred_8 ?v2)
             (pred_11 ?v5)
             (pred_5 ?v1)
             (pred_6 ?v2)
             (pred_12 ?v1)
             (pred_10 ))



(:action op_3
:parameters (?v11 ?v7 ?v12 ?v3)
:precondition (and (pred_7 ?v11) (pred_7 ?v7) (pred_8 ?v12) (pred_11 ?v3)
          (pred_3 ?v11 ?v7) (pred_9 ?v12 ?v3)
                   (pred_1 ?v7 ?v3) (pred_4 ?v11) 
                   (pred_5 ?v7) (pred_6 ?v12))
:effect (and  (pred_12 ?v7) (not (pred_5 ?v7))))


(:action op_2
:parameters (?v11 ?v10)
:precondition (and (pred_7 ?v11) (pred_7 ?v10)
               (pred_4 ?v11) (pred_3 ?v11 ?v10) (pred_12 ?v10))
:effect (and (pred_4 ?v10) (not (pred_4 ?v11))))

(:action op_1
:parameters (?v11 ?v12)
:precondition (and (pred_7 ?v11) (pred_8 ?v12) 
                  (pred_4 ?v11) (pred_2 ?v12 ?v11) (pred_10 ))
:effect (and (pred_6 ?v12)
   (not (pred_2 ?v12 ?v11)) (not (pred_10 ))))


(:action op_5
:parameters (?v11 ?v13 ?v4)
:precondition (and (pred_7 ?v11) (pred_8 ?v13) (pred_8 ?v4)
                  (pred_4 ?v11) (pred_6 ?v4) (pred_2 ?v13 ?v11))
:effect (and (pred_6 ?v13) (pred_2 ?v4 ?v11)
        (not (pred_6 ?v4)) (not (pred_2 ?v13 ?v11))))

(:action op_4
:parameters (?v11 ?v12)
:precondition (and (pred_7 ?v11) (pred_8 ?v12) 
                  (pred_4 ?v11) (pred_6 ?v12))
:effect (and (pred_10 ) (pred_2 ?v12 ?v11) (not (pred_6 ?v12)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_04 obj_23 obj_11 obj_24 obj_13 obj_08 obj_30 obj_02 obj_32 obj_16 obj_09 obj_05 obj_26 obj_01 obj_22 obj_14 obj_20 obj_19 obj_29 obj_07 obj_06 obj_27 obj_10 obj_25 obj_17
    obj_21 obj_31 obj_18
    obj_12 obj_03 obj_28 obj_15
    )

    (:init
       (pred_10)

       (pred_7 obj_04)
       (pred_7 obj_23)
       (pred_7 obj_11)
       (pred_7 obj_24)
       (pred_7 obj_13)
       (pred_7 obj_08)
       (pred_7 obj_30)
       (pred_7 obj_02)
       (pred_7 obj_32)
       (pred_7 obj_16)
       (pred_7 obj_09)
       (pred_7 obj_05)
       (pred_7 obj_26)
       (pred_7 obj_01)
       (pred_7 obj_22)
       (pred_7 obj_14)
       (pred_7 obj_20)
       (pred_7 obj_19)
       (pred_7 obj_29)
       (pred_7 obj_07)
       (pred_7 obj_06)
       (pred_7 obj_27)
       (pred_7 obj_10)
       (pred_7 obj_25)
       (pred_7 obj_17)
       (pred_11 obj_21)
       (pred_11 obj_31)
       (pred_11 obj_18)
       (pred_8 obj_12)
       (pred_8 obj_03)
       (pred_8 obj_28)
       (pred_8 obj_15)

       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_23)
       (pred_3 obj_23 obj_30)
       (pred_3 obj_23 obj_11)
       (pred_3 obj_23 obj_04)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_24)
       (pred_3 obj_11 obj_23)
       (pred_3 obj_24 obj_32)
       (pred_3 obj_24 obj_13)
       (pred_3 obj_24 obj_11)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_24)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_08 obj_30)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_30 obj_02)
       (pred_3 obj_30 obj_23)
       (pred_3 obj_30 obj_08)
       (pred_3 obj_02 obj_26)
       (pred_3 obj_02 obj_32)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_02 obj_30)
       (pred_3 obj_32 obj_01)
       (pred_3 obj_32 obj_16)
       (pred_3 obj_32 obj_24)
       (pred_3 obj_32 obj_02)
       (pred_3 obj_16 obj_22)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_32)
       (pred_3 obj_09 obj_14)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_05 obj_20)
       (pred_3 obj_05 obj_26)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_26 obj_19)
       (pred_3 obj_26 obj_01)
       (pred_3 obj_26 obj_02)
       (pred_3 obj_26 obj_05)
       (pred_3 obj_01 obj_29)
       (pred_3 obj_01 obj_22)
       (pred_3 obj_01 obj_32)
       (pred_3 obj_01 obj_26)
       (pred_3 obj_22 obj_07)
       (pred_3 obj_22 obj_16)
       (pred_3 obj_22 obj_01)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_14 obj_20)
       (pred_3 obj_14 obj_09)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_20 obj_05)
       (pred_3 obj_20 obj_14)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_19 obj_29)
       (pred_3 obj_19 obj_26)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_29 obj_25)
       (pred_3 obj_29 obj_07)
       (pred_3 obj_29 obj_01)
       (pred_3 obj_29 obj_19)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_07 obj_22)
       (pred_3 obj_07 obj_29)
       (pred_3 obj_06 obj_27)
       (pred_3 obj_06 obj_14)
       (pred_3 obj_27 obj_10)
       (pred_3 obj_27 obj_20)
       (pred_3 obj_27 obj_06)
       (pred_3 obj_10 obj_25)
       (pred_3 obj_10 obj_19)
       (pred_3 obj_10 obj_27)
       (pred_3 obj_25 obj_17)
       (pred_3 obj_25 obj_29)
       (pred_3 obj_25 obj_10)
       (pred_3 obj_17 obj_07)
       (pred_3 obj_17 obj_25)
       (pred_5 obj_29)
       (pred_5 obj_06)
       (pred_5 obj_04)
       (pred_5 obj_14)
       (pred_1  obj_29 obj_21)
       (pred_1  obj_06 obj_31)
       (pred_1  obj_04 obj_18)
       (pred_1  obj_14 obj_31)
       (pred_12 obj_23)
       (pred_12 obj_11)
       (pred_12 obj_24)
       (pred_12 obj_13)
       (pred_12 obj_08)
       (pred_12 obj_30)
       (pred_12 obj_02)
       (pred_12 obj_32)
       (pred_12 obj_16)
       (pred_12 obj_09)
       (pred_12 obj_05)
       (pred_12 obj_26)
       (pred_12 obj_01)
       (pred_12 obj_22)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_27)
       (pred_12 obj_10)
       (pred_12 obj_25)
       (pred_12 obj_17)

       (pred_9  obj_12 obj_21)
       (pred_9  obj_03 obj_31)
       (pred_9  obj_28 obj_18)
       (pred_9  obj_15 obj_18)
       (pred_2 obj_12 obj_07)
       (pred_2 obj_03 obj_16)
       (pred_2 obj_28 obj_08)
       (pred_2 obj_15 obj_20)
       (pred_4 obj_24)
    )

    (:goal (and
       (pred_2 obj_12 obj_29)
    ))
(:constraints
  (always (not (pred_4 obj_01)))
)
)

; plan
1. (op_2 obj_24 obj_32)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_32)
   goals met: 0 of 1
2. (op_2 obj_32 obj_16)
   deleted: (pred_4 obj_32)
   added: (pred_4 obj_16)
   goals met: 0 of 1
3. (op_2 obj_16 obj_22)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_22)
   goals met: 0 of 1
4. (op_2 obj_22 obj_07)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_07)
   goals met: 0 of 1
5. (op_1 obj_07 obj_12)
   deleted: (pred_2 obj_12 obj_07) (pred_10)
   added: (pred_6 obj_12)
   goals met: 0 of 1
6. (op_3 obj_07 obj_29 obj_12 obj_21)
   deleted: (pred_5 obj_29)
   added: (pred_12 obj_29)
   goals met: 0 of 1
7. (op_2 obj_07 obj_29)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_29)
   goals met: 0 of 1
8. (op_4 obj_29 obj_12)
   deleted: (pred_6 obj_12)
   added: (pred_10) (pred_2 obj_12 obj_29)
   goals met: 1 of 1
